Revit 2027 API
BendingDetailCustomFieldProperties.MultipleValuesIndicatorOption Property
 Identifies how the Bending Detail will represent the varying rebar dimensions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailCustomFieldMultipleValuesIndicatorOptions MultipleValuesIndicatorOption { get; set; }
Public Property MultipleValuesIndicatorOption As BendingDetailCustomFieldMultipleValuesIndicatorOptions
	Get
	Set
public:
property BendingDetailCustomFieldMultipleValuesIndicatorOptions MultipleValuesIndicatorOption {
	BendingDetailCustomFieldMultipleValuesIndicatorOptions get ();
	void set (BendingDetailCustomFieldMultipleValuesIndicatorOptions value);
}
member MultipleValuesIndicatorOption : BendingDetailCustomFieldMultipleValuesIndicatorOptions with get, set
Property Value
BendingDetailCustomFieldMultipleValuesIndicatorOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace